cask_args appdir: '/Applications'

# Taps
tap 'anomalyco/tap'
tap 'bufbuild/buf'
tap 'common-fate/granted'
tap 'mike-engel/jwt-cli'
tap 'shopify/shopify'

# CLI essentials
brew 'bat'
brew 'broot'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'direnv'
brew 'eza'
brew 'fzf'
brew 'htop'
brew 'jq'
brew 'prettyping'
brew 'ripgrep'
brew 'rsync'
brew 'tree'
brew 'wget'
brew 'yq'
brew 'zoxide'

# Shell
brew 'zsh'

# Version control
brew 'gh'
brew 'git'
brew 'git-filter-repo'

# Editors & terminal
brew 'tmux'
brew 'vim'

# Languages & runtimes
brew 'deno'
brew 'go'
brew 'mise'
brew 'node-build'
brew 'pipx'
brew 'pnpm'
brew 'ruby-build'
brew 'yarn'
brew 'bun'

# Cloud & infrastructure
brew 'awscli'
brew 'cloudflared'
brew 'sops'
# terraform was relicensed (BSL) and removed from homebrew-core, which aborts
# the whole `brew bundle`. Install pinned 1.5.7 (last open-source) via tfenv or
# mise to match the existing machine instead of taking BSL latest from a tap.
# brew 'terraform'
brew 'common-fate/granted/granted'

# Containers & orchestration
brew 'colima', restart_service: :changed
brew 'docker'
brew 'docker-compose'
brew 'helm'
brew 'minikube'

# Databases
brew 'mysql@8.4', restart_service: :changed
brew 'mysql-client'
brew 'postgresql@17', restart_service: :changed
brew 'redis', restart_service: :changed

# Dev tools
brew 'bats-core'
brew 'bufbuild/buf/buf'
brew 'cmake'
brew 'contentful-cli'
brew 'cookiecutter'
brew 'ctags'
brew 'mike-engel/jwt-cli/jwt-cli'
brew 'shellcheck'
brew 'shopify/shopify/shopify-cli'

# AI tools
brew 'anomalyco/tap/opencode'

# Image & media
brew 'exiftool'
brew 'ffmpeg'
brew 'highlight'
brew 'imagemagick'
brew 'poppler'
brew 'spark'
brew 'yt-dlp'

# Networking & system
brew 'bluetoothconnector'
brew 'gnupg'
brew 'gping'
brew 'hostess'
brew 'pam-reattach'
brew 'pinentry-mac'
brew 'wakeonlan'

# Casks
cask '1password-cli'
cask 'alt-tab'
cask 'font-fira-code-nerd-font'
cask 'ghostty'
cask 'ngrok'
cask 'qlmarkdown'
cask 'session-manager-plugin'
cask 'teleport-connect'
