cask_args appdir: '/Applications'

# Taps
tap 'anomalyco/tap'
tap 'aws/tap'
tap 'bufbuild/buf'
tap 'common-fate/granted'
tap 'homebrew/services'
tap 'mike-engel/jwt-cli'
tap 'oven-sh/bun'
tap 'pkgxdev/made'
tap 'shopify/shopify'

# CLI essentials
brew 'bat'
brew 'broot'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'direnv'
brew 'fzf'
brew 'htop'
brew 'jq'
brew 'prettyping'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tree'
brew 'wget'
brew 'yq'
brew 'zoxide'

# Shell
brew 'zsh'

# Version control
brew 'gh'
brew 'git'
brew 'git-filter-repo'

# Editors & terminal
brew 'tmux'
brew 'vim'
brew 'zellij'

# Languages & runtimes
brew 'deno'
brew 'go'
brew 'mise'
brew 'node-build'
brew 'php', restart_service: :changed
brew 'ruby-build'
brew 'rust'
brew 'rustup'
brew 'oven-sh/bun/bun'

# Cloud & infrastructure
brew 'aws-sam-cli'
brew 'awscli'
brew 'cloudflared'
brew 'sops'
brew 'common-fate/granted/granted'
brew 'onrunning/on/mfaws'

# Containers & orchestration
brew 'colima', restart_service: :changed
brew 'docker'
brew 'docker-compose'
brew 'minikube'

# Databases
brew 'mysql@8.4', restart_service: :changed
brew 'postgresql@14'
brew 'redis', restart_service: :changed

# Dev tools
brew 'bufbuild/buf/buf'
brew 'cmake'
brew 'cookiecutter'
brew 'ctags'
brew 'mike-engel/jwt-cli/jwt-cli'
brew 'phrase-cli'
brew 'shopify/shopify/shopify-cli'
brew 'pkgxdev/made/pkgx'

# AI tools
brew 'anomalyco/tap/opencode'

# Image & media
brew 'imagemagick'
brew 'spaceman-diff'
brew 'spark'
brew 'highlight'

# Networking & system
brew 'ack'
brew 'bluetoothconnector'
brew 'gnupg'
brew 'gping'
brew 'hostess'
brew 'pinentry-mac'
brew 'wakeonlan'

# Casks
cask '1password-cli'
cask 'alt-tab'
cask 'font-fira-code-nerd-font'
cask 'ngrok'
cask 'qlmarkdown'
cask 'session-manager-plugin'
cask 'teleport-connect'
